app/Controllers/Blog.php

SELECT *
FROM `blogs`
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `blogs`
---
    public function index()
    {
        $model = new BlogModel();
        // $data['blog'] = $model->get_blog();

        $data = [
            'blogs' => $model->paginate(8),
            'title' => 'Latest blogs',
            'pager' => $model->pager,
        ];