app/Controllers/Blog.php

    public function single($id = false)
    {
        $id = 2;
        echo $id . " is your passed id";
        $model = new BlogModel();
        $post = $model->find($id);
---
SELECT *
FROM `blogs`
WHERE `blogs`.`id` = 2