app/Models/BlogModel.php

SELECT *
FROM `blogs`
SELECT *
FROM `blogs`
WHERE `id` = 3
 LIMIT 1
---
    public function get_blog($id = false)
    {
        if ($id === false) {
            return $this->findAll();
        } else {
            return $this->getwhere(['blog_id' => $id]);