app/Models/ProductModel.php

SELECT *
FROM `products`
---
    public function getProduct($id = false)
    {
        if ($id === false) {
            return $this->findAll();